<a href="https://colab.research.google.com/github/SANGSEOSEO/philosophy_datascience/blob/master/%5B%EC%8B%A4%EC%8A%B5%5DCh01_pandas_02_Series_v_s_DataFrame_using_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## 1. pandas 패키지 로드

In [30]:
import pandas as pd
import numpy as np

### 별칭은 주로 pd로 사용합니다.

In [3]:
# 코드를 입력해 주세요
pd

In [4]:
pd

## 2. pandas 의 Series 와 DataFrame

1차원, 1개의 column은 Series라고 합니다.

### 2-1. Series

In [2]:
a = [1, 2, 3, 4]

In [3]:
pd.Series(a)

0    1
1    2
2    3
3    4
dtype: int64

In [4]:
myList = [1, 2, 3, 4]

In [31]:
myList2= np.arange(1, 10, 2)

In [32]:
pd.DataFrame(myList2)

   0
0  1
1  3
2  5
3  7
4  9

In [5]:
pd.Series(myList)

0    1
1    2
2    3
3    4
dtype: int64

### 2-2. DataFrame

#### 방법 1. list로 만들기

In [6]:
# 2차원 리스트 
company1 = [
            ['SAMSUNG', 2000, 'SmartPhone'],
            ['HYUNDAI', 1000, '자동차'],
            ['NAVER', 5000, 'PORTAL']
            ]

In [7]:
pd.DataFrame(company1)

         0     1           2
0  SAMSUNG  2000  SmartPhone
1  HYUNDAI  1000         자동차
2    NAVER  5000      PORTAL

In [8]:
# 데이터 프레임 객체 
pd.DataFrame(data=company1,index=['A', 'B', 'C'], columns=['기업명', '매출액', '업종'])

       기업명   매출액          업종
A  SAMSUNG  2000  SmartPhone
B  HYUNDAI  1000         자동차
C    NAVER  5000      PORTAL

In [9]:
pd.DataFrame(data=company1, columns=['company', 'sales_amount', 'sector'])

   company  sales_amount      sector
0  SAMSUNG          2000  SmartPhone
1  HYUNDAI          1000         자동차
2    NAVER          5000      PORTAL

In [10]:
# 변수에 할당
df1 = pd.DataFrame(company1)

In [11]:
df1

         0     1           2
0  SAMSUNG  2000  SmartPhone
1  HYUNDAI  1000         자동차
2    NAVER  5000      PORTAL

#### 제목컬럼 만들기
 - DataFrame을 생성할때 만들어도 되고 아래처럼 해도됨

In [35]:
# ValueError: Length mismatch: Expected axis has 3 elements, new values have 2 elements
df1.columns= ['기업명', '매출액']

In [12]:
df1.columns = ['기업명', '매출액', '업종']

In [13]:
df1

       기업명   매출액          업종
0  SAMSUNG  2000  SmartPhone
1  HYUNDAI  1000         자동차
2    NAVER  5000      PORTAL

#### 방법 2. dict로 만들기

In [17]:
# key가 컬럼명으로 사용됨
company2 = {
      '회사명':['삼성', '현대', '네이버'],
      '매출액':[1000, 4000, 5000],
      '업종':['SmartPhone', 'AutoMobile', 'Portal']
}

In [19]:
df2 = pd.DataFrame(company2)

In [20]:
df2

   회사명   매출액          업종
0   삼성  1000  SmartPhone
1   현대  4000  AutoMobile
2  네이버  5000      Portal

#### index를 특정 column으로 지정하기

In [36]:
df1

             기업명   매출액          업종
기업명
SAMSUNG  SAMSUNG  2000  SmartPhone
HYUNDAI  HYUNDAI  1000         자동차
NAVER      NAVER  5000      PORTAL

In [25]:
# 기업명을 인덱스로 지정한다.
# 데이터 프레임을 만들때 지정하지 않으면 default로 0, 1, 2,..로 
df1.index = df1['기업명']

In [26]:
df1

             기업명   매출액          업종
기업명
SAMSUNG  SAMSUNG  2000  SmartPhone
HYUNDAI  HYUNDAI  1000         자동차
NAVER      NAVER  5000      PORTAL

#### series = column 이라고 하였습니다. 확인해 볼까요?

In [27]:
df1['매출액'] , df1['기업명']

(기업명
 SAMSUNG    2000
 HYUNDAI    1000
 NAVER      5000
 Name: 매출액, dtype: int64, 기업명
 SAMSUNG    SAMSUNG
 HYUNDAI    HYUNDAI
 NAVER        NAVER
 Name: 기업명, dtype: object)

In [28]:
df1["업종"]

기업명
SAMSUNG    SmartPhone
HYUNDAI           자동차
NAVER          PORTAL
Name: 업종, dtype: object

In [ ]:
type(df1['매출액']), type(df1['업종'])

(pandas.core.series.Series, pandas.core.series.Series)

In [37]:
# series가 갖는 API
[api for api in dir(df1['기업명']) if not api.startswith('_')]

['HYUNDAI',
 'NAVER',
 'SAMSUNG',
 'T',
 'abs',
 'add',
 'add_prefix',
 'add_suffix',
 'agg',
 'aggregate',
 'align',
 'all',
 'any',
 'append',
 'apply',
 'argmax',
 'argmin',
 'argsort',
 'array',
 'asfreq',
 'asof',
 'astype',
 'at',
 'at_time',
 'attrs',
 'autocorr',
 'axes',
 'between',
 'between_time',
 'bfill',
 'bool',
 'clip',
 'combine',
 'combine_first',
 'convert_dtypes',
 'copy',
 'corr',
 'count',
 'cov',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'describe',
 'diff',
 'div',
 'divide',
 'divmod',
 'dot',
 'drop',
 'drop_duplicates',
 'droplevel',
 'dropna',
 'dtype',
 'dtypes',
 'duplicated',
 'empty',
 'eq',
 'equals',
 'ewm',
 'expanding',
 'explode',
 'factorize',
 'ffill',
 'fillna',
 'filter',
 'first',
 'first_valid_index',
 'floordiv',
 'ge',
 'get',
 'groupby',
 'gt',
 'hasnans',
 'head',
 'hist',
 'iat',
 'idxmax',
 'idxmin',
 'iloc',
 'index',
 'infer_objects',
 'interpolate',
 'is_monotonic',
 'is_monotonic_decreasing',
 'is_monotonic_increasing',
 'is_unique',
 'isin',
 'isna',
 'isnull',
 'item',
 'items',
 'iteritems',
 'keys',
 'kurt',
 'kurtosis',
 'last',
 'last_valid_index',
 'le',
 'loc',
 'lt',
 'mad',
 'map',
 'mask',
 'max',
 'mean',
 'median',
 'memory_usage',
 'min',
 'mod',
 'mode',
 'mul',
 'multiply',
 'name',
 'nbytes',
 'ndim',
 'ne',
 'nlargest',
 'notna',
 'notnull',
 'nsmallest',
 'nunique',
 'pct_change',
 'pipe',
 'plot',
 'pop',
 'pow',
 'prod',
 'product',
 'quantile',
 'radd',
 'rank',
 'ravel',
 'rdiv',
 'rdivmod',
 'reindex',
 'reindex_like',
 'rename',
 'rename_axis',
 'reorder_levels',
 'repeat',
 'replace',
 'resample',
 'reset_index',
 'rfloordiv',
 'rmod',
 'rmul',
 'rolling',
 'round',
 'rpow',
 'rsub',
 'rtruediv',
 'sample',
 'searchsorted',
 'sem',
 'set_axis',
 'shape',
 'shift',
 'size',
 'skew',
 'slice_shift',
 'sort_index',
 'sort_values',
 'squeeze',
 'std',
 'str',
 'sub',
 'subtract',
 'sum',
 'swapaxes',
 'swaplevel',
 'tail',
 'take',
 'to_clipboard',
 'to_csv',
 'to_dict',
 'to_excel',
 'to_frame',
 'to_hdf',
 'to_json',
 'to_latex',
 'to_list',
 'to_markdown',
 'to_numpy',
 'to_period',
 'to_pickle',
 'to_sql',
 'to_string',
 'to_timestamp',
 'to_xarray',
 'transform',
 'transpose',
 'truediv',
 'truncate',
 'tshift',
 'tz_convert',
 'tz_localize',
 'unique',
 'unstack',
 'update',
 'value_counts',
 'values',
 'var',
 'view',
 'where',
 'xs']